# ExternalCommandData Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalCommandData Members
ExternalCommandData Class Methods Properties See Also
---
The ExternalCommandData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Causes the object to release immediately any resources it may be utilizing. (Inherited from APIObject.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Application | Retrieves an object that represents the current Application for external command. |
| IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from APIObject.) |
| JournalData | A data map that can be used to read and write data to the Autodesk Revit journal file. |
| View | Retrieves an object that represents the View external command work on. |

# See Also
ExternalCommandData Class
Autodesk.Revit.UI Namespace